{
  "completed-courses": [
    {
      "link": "https://www.aws.training/Details/eLearning?id=33230",
      "title": "IoT Microcontrollers: Onboarding the Amazon FreeRTOS Simulator for Windows",
      "registration-date": "2 June, 2020",
      "description": "This digital training provides a walkthrough of the onboarding process for the Amazon FreeRTOS Windows simulator with the IoT Core.",
      "level": "INTERMEDIATE",
      "duration": "30 MINUTES",
      "prereqsuisites": [
        {
          "title": "IoT Foundation: Telemetry",
          "href": "https://www.aws.training/learningobject/wbc?id=23507"
        },
        {
          "title": "IoT Foundation: Command and Control",
          "href": "https://www.aws.training/learningobject/wbc?id=23822"
        },
        {
          "title": "IoT Edge Computing: Amazon FreeRTOS Primer",
          "href": "https://www.aws.training/learningobject/wbc?id=33191"
        }
      ]
    },
    {
      "link": "https://www.aws.training/Details/Curriculum?id=33308",
      "title": "Internet of Things (IoT) Microcontrollers Series",
      "registration-date": "2 June, 2020",
      "description": "The Internet of Things (IoT) Microcontroller Series comprises a set of courses that cover different aspects of working with physical devices and connecting them to AWS IoT. Each class in this series will address a specific task; such as, onboarding or connecting multiple devices to an edge node.",
      "level": "INTERMEDIATE",
      "duration": "1 1/2 HOURS",
      "prereqsuisites": [
        {
          "title": "Introduction to AWS IoT",
          "href": "https://www.aws.training/learningobject/video?id=16505"
        },
        {
          "title": "IoT Foundation: Telemetry",
          "href": "https://www.aws.training/learningobject/wbc?id=23507"
        },
        {
          "title": "IoT Foundation: Command and Control",
          "href": "https://www.aws.training/learningobject/wbc?id=23822"
        }
      ]
    },
    {
      "link": "https://www.aws.training/Details/eLearning?id=34593",
      "title": "IoT Microcontrollers: Onboarding an ESP32 with Amazon FreeRTOS",
      "registration-date": "2 June, 2020",
      "description": "This digital training provides a walkthrough of the onboarding process for the ESP32 DevKitC V4 with Amazon FreeRTOS.",
      "level": "INTERMEDIATE",
      "duration": "30 MINUTES",
      "prereqsuisites": [
        {
          "title": "IoT Foundation: Telemetry",
          "href": "https://www.aws.training/learningobject/wbc?id=23507"
        },
        {
          "title": "IoT Foundation: Command and Control",
          "href": "https://www.aws.training/learningobject/wbc?id=23822"
        },
        {
          "title": "IoT Edge Computing: Amazon FreeRTOS Primer",
          "href": "https://www.aws.training/learningobject/wbc?id=33191"
        }
      ]
    },
    {
      "link": "https://www.aws.training/Details/eLearning?id=33872",
      "title": "IoT Microcontrollers: Onboarding a Raspberry Pi Using AWS Greengrass",
      "registration-date": "1 June, 2020",
      "description": "This video provides a walkthrough of onboarding a Raspberry Pi as an AWS IoT Greengrass core.",
      "level": "INTERMEDIATE",
      "duration": "30 MINUTES",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/eLearning?id=33191",
      "title": "IoT Edge Computing: Amazon FreeRTOS Primer",
      "registration-date": "1 June, 2020",
      "description": "This course focuses on learning how to configure, deploy, and manage devices using Amazon FreeRTOS.",
      "level": "INTERMEDIATE",
      "duration": "3 HOURS",
      "prereqsuisites": [
        {
          "title": "IoT Foundation: Telemetry",
          "href": "https://www.aws.training/learningobject/wbc?id=23507"
        },
        {
          "title": "IoT Foundation: Command and Control",
          "href": "https://www.aws.training/learningobject/wbc?id=23822"
        },
        {
          "title": "IoT Edge Computing: Introduction to Amazon FreeRTOS",
          "href": "https://www.aws.training/learningobject/video?id=16622"
        }
      ]
    },
    {
      "link": "https://www.aws.training/Details/eLearning?id=26852",
      "title": "IoT Foundation: Predictive Maintenance",
      "registration-date": "29 May, 2020",
      "description": "This is the fourth course in the AWS Internet of Things (IoT) Foundation series. In this course, you will build on the concepts introduced in previous lessons, which covered onboarding single devices, establishing communication with them, collecting and visualizing data received, and managing a fleet of devices. This course focuses on using AWS services to predict failure of IoT devices in an industrial setting. You will also learn how to use AWS services such as AWS IoT Analytics, AWS IoT Rules Engine, and AWS QuickSight to collect, visualize, and analyze data in order to take automated action based on data collected from your IoT devices.",
      "level": "INTERMEDIATE",
      "duration": "2 HOURS",
      "prereqsuisites": [
        {
          "title": " IoT Foundation Series",
          "href": "https://www.aws.training/learningobject/curriculum?id=27289"
        },
        {
          "title": "IoT Foundation: Telemetry",
          "href": "https://www.aws.training/learningobject/wbc?id=23507"
        },
        {
          "title": "IoT Foundation: Command and Control",
          "href": "https://www.aws.training/learningobject/wbc?id=23822"
        },
        {
          "title": "IoT Foundation: Introduction to Fleet Management",
          "href": "https://www.aws.training/learningobject/wbc?id=26760"
        }
      ]
    },
    {
      "link": "https://www.aws.training/Details/Curriculum?id=27289",
      "title": "Internet of Things Foundation Series",
      "registration-date": "29 May, 2020",
      "description": "The Internet of Things (IoT) Foundation Series comprises a set of courses that offer a broad experience across IoT Core and its associated services. Each class in the series is centered around a scenario where a fictitious customer has a business challenge. The information and activities in the class provide the knowledge and skills to overcome this challenge.",
      "level": "INTERMEDIATE",
      "duration": "9 1/2 HOURS",
      "prereqsuisites": [
        {
          "title": "Introduction to AWS IoT",
          "href": "https://www.aws.training/learningobject/video?id=16505"
        }
      ]
    },
    {
      "link": "https://www.aws.training/Details/eLearning?id=26760",
      "title": "IoT Foundation: Introduction to Fleet Management",
      "registration-date": "28 May, 2020",
      "description": "This is the third course in the AWS Internet of Things (IoT) Foundation series. This course builds on concepts introduced in previous lessons that covered onboarding single devices, establishing communication, and collecting and visualizing data. This course focuses on how to manage a fleet of devices and prepare for fleet management, provision fleets in advance and on-demand, and gather information about the devices. Additionally, the course emphasizes running commands from the command line interface (AWS CLI).",
      "level": "INTERMEDIATE",
      "duration": "3 HOURS",
      "prereqsuisites": [
        {
          "title": "IoT Foundation Series",
          "href": "https://www.aws.training/learningobject/curriculum?id=27289"
        },
        {
          "title": "IoT Foundation: Telemetry",
          "href": "https://www.aws.training/learningobject/video?id=16505"
        },
        {
          "title": "IoT Foundation: Command and Control",
          "href": "https://www.aws.training/learningobject/wbc?id=23822"
        }
      ]
    },
    {
      "link": "https://www.aws.training/Details/eLearning?id=23822",
      "title": "IoT Foundation: Command and Control",
      "registration-date": "27 May, 2020",
      "description": "This is the second course in the Amazon Web Services (AWS) Internet of Things (IoT) Foundations series. At the beginning of this class, we will describe a scenario that requires a specific business outcome. We will then present information and demonstrations that will progress through the solution in order to accomplish that outcome.",
      "level": "INTERMEDIATE",
      "duration": "2 HOURS",
      "prereqsuisites": [
        {
          "title": "IoT Foundation Series",
          "href": "https://www.aws.training/learningobject/curriculum?id=27289"
        },
        {
          "title": "Introduction to AWS Internet of Things",
          "href": "https://www.aws.training/learningobject/video?id=16505"
        }
      ]
    },
    {
      "link": "https://www.aws.training/Details/eLearning?id=48709",
      "title": "IoT Foundation: Telemetry",
      "registration-date": "27 May, 2020",
      "description": "Billions of small, physical devices, such as sensors and actuators, are currently deployed in homes, factories, hospitals, and in other business use cases. This proliferation of devices requires solutions to connect, collect, store, and analyze the data these devices generate. By using AWS IoT, you can build IoT solutions for most use cases across a wide range of devices. Being able to build and administer an IoT infrastructure is quickly becoming the skill set of the future.",
      "level": "INTERMEDIATE",
      "duration": "2 1/2 HOURS",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/Curriculum?id=42037",
      "title": "AWS Well-Architected",
      "registration-date": "25 May, 2020",
      "description": "This course teaches our customers about the AWS Well-Architected Framework to understand how they can make informed decisions about their architecture in a cloud-native way and understand the impact of design decisions. By using the Well-Architected Framework, customers can understand the risks in their architecture, and learn ways to mitigate them.",
      "level": "FUNDAMENTAL",
      "duration": "1 1/2 HOURS",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/Curriculum?id=38111",
      "title": "AWS Database Offerings",
      "registration-date": "22 May, 2020",
      "description": "This self-paced course provides a basic overview of different database technologies and architectures and introduces you to the various Amazon Web Services (AWS) database services. The course also covers the concept of the purpose-built database, which changes the one-size-fits-all methodology that previously existed.",
      "level": "FUNDAMENTAL",
      "duration": "5 1/2 HOURS",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/eLearning?id=39246",
      "title": "AWS Storage Offerings",
      "registration-date": "22 May, 2020",
      "description": "This course helps you distinguish the differences between the multiple AWS storage services and provides an introduction to the different storage types, including block, file, object, and hybrid storage. The many AWS services that provide these types of storage are introduced at a high level so that you can begin to consider the appropriate storage options for your applications that need access to data.",
      "level": "FUNDAMENTAL",
      "duration": "100 MINUTES",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/Video?id=27497",
      "title": "Network Ninja to Cloud Ninja",
      "registration-date": "21 May, 2020",
      "description": "In this course, we will address questions like \"How does moving to cloud affect me as a network architect/engineer? Is there a place for my skills in the cloud? If there is a place for me, what will I do differently in the cloud? Are there any cool things I can do in the cloud, but can’t do off-cloud?\".",
      "level": "FUNDAMENTAL",
      "duration": "30 MINUTES",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/eLearning?id=34259",
      "title": "AWS Security Fundamentals (Second Edition) ",
      "registration-date": "20 May, 2020",
      "description": "In this self-paced course, you will learn fundamental AWS cloud security concepts, including AWS access control, data encryption methods, and how network access to your AWS infrastructure can be secured. We will address and your security responsibility in the AWS cloud and the different security-oriented services available.",
      "level": "FUNDAMENTAL",
      "duration": "2 HOURS",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/eLearning?id=20294",
      "title": "Machine Learning Terminology and Process",
      "registration-date": "19 May, 2020",
      "description": "This course introduces you to basic machine learning concepts and the machine process the data goes through. We explore each step in the machine learning process in detail and explain some of the common terms and techniques that occur during a phase of a ML project.",
      "level": "INTERMEDIATE",
      "duration": "1 HOUR",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/Curriculum?id=27241",
      "title": "Demystifying AI/ML/DL",
      "registration-date": "19 May, 2020",
      "description": "After taking this set of courses, you’ll understand how artificial intelligence (AI) led to machine learning (ML), which then led to deep learning (DL).",
      "level": "FUNDAMENTAL",
      "duration": "45 MINUTES",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/Video?id=27405",
      "title": "What is Deep Learning?",
      "registration-date": "19 May, 2020",
      "description": "This introductory course provides an overview of Deep Learning (DL) concepts. In the course, we discuss the AWS services available for DL and walk through a case study of an AWS customer who is innovating with DL.",
      "level": "FUNDAMENTAL",
      "duration": "20 MINUTES",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/Video?id=27404",
      "title": "What is Machine Learning?",
      "registration-date": "19 May, 2020",
      "description": "This course introduces you to machine learning concepts and the role data plays. We explore use cases, discuss an innovative way to build smart applications, and review the AWS frameworks and services you can use for machine learning.",
      "level": "FUNDAMENTAL",
      "duration": "10 MINUTES",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/Video?id=27394",
      "title": "What is Artificial Intelligence?",
      "registration-date": "19 May, 2020",
      "description": "This is an introductory course on artificial intelligence (AI). In the course, we discuss what AI is and why it is important, and take a brief look at machine learning and deep learning—which are subsets of AI—and describe how Amazon uses AI in its products.",
      "level": "FUNDAMENTAL",
      "duration": "10 MINUTES",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/eLearning?id=27197",
      "title": "AWS Lambda Foundations",
      "registration-date": "18 May, 2020",
      "description": "This course introduces AWS Lambda and teaches you the basics of how you configure it to connect to other AWS services. You will also learn about the factors that impact function performance and how serverless development and deployment practices differ from those in traditional deployment environments.",
      "level": "FUNDAMENTAL",
      "duration": "60 MINUTES",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/Curriculum?id=27076",
      "title": "AWS Cloud Practitioner Essentials (Second Edition)",
      "registration-date": "18 May, 2020",
      "description": "The fundamental-level course is intended for individuals who seek an overall understanding of the AWS Cloud, independent of specific technical roles. It provides a detailed overview of cloud concepts, AWS services, security, architecture, pricing, and support. This course also helps you prepare for the AWS Certified Cloud Practitioner exam.",
      "level": "FUNDAMENTAL",
      "duration": "6 HOURS",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/eLearning?id=29704",
      "title": "AWS Cloud Practitioner Essentials (Second Edition): Pricing and Support",
      "registration-date": "18 May, 2020",
      "description": "This module focuses on pricing for the AWS Cloud. It starts with a general introduction to our philosophy on pricing, covers the actual pricing characteristics for many of our core offerings, and covers some tools that we’ve developed to help you control your costs and ensure you’re getting the best value for your money. It also includes information on available support plans.",
      "level": "FUNDAMENTAL",
      "duration": "30 MINUTES",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/eLearning?id=29703",
      "title": "AWS Cloud Practitioner Essentials (Second Edition): AWS Security",
      "registration-date": "18 May, 2020",
      "description": "In this module, you will learn how to describe basic security and compliance aspects of the AWS platform and the shared security model.",
      "level": "FUNDAMENTAL",
      "duration": "50 MINUTES",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/eLearning?id=29702",
      "title": "AWS Cloud Practitioner Essentials (Second Edition): AWS Architecture",
      "registration-date": "17 May, 2020",
      "description": "This module focuses on architectural considerations for deploying or migrating to the AWS Cloud. The module covers the fundamentals of a well architected solution, discusses fault tolerance and availability, and wraps up with a section on web hosting on the AWS Cloud.",
      "level": "FUNDAMENTAL",
      "duration": "30 MINUTES",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/eLearning?id=29701",
      "title": "AWS Cloud Practitioner Essentials (Second Edition): AWS Integrated Services",
      "registration-date": "17 May, 2020",
      "description": "This module focuses on some of the integrated services that are part of the AWS Cloud, including Application Load Balancer, Auto Scaling, Amazon Route 53, Amazon Relational Database Services (RDS), AWS Lambda, AWS Elastic Beanstalk, Amazon Simple Notification Service (SNS), Amazon CloudWatch, Amazon CloudFront, and AWS CloudFormation.",
      "level": "FUNDAMENTAL",
      "duration": "100 MINUTES",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/eLearning?id=29700",
      "title": "AWS Cloud Practitioner Essentials (Second Edition): AWS Core Services\t",
      "registration-date": "16 May, 2020",
      "description": "This module is comprised of a series of videos that provide high level information about several AWS Cloud services, including Amazon Elastic Cloud Compute (EC2), Amazon Elastic Block Store (EBS), Amazon Simple Storage Service (S3), the AWS Global Infrastructure, Amazon Virtual Private Cloud (VPC), and Security Groups.",
      "level": "FUNDAMENTAL",
      "duration": "45 MINUTES",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/Video?id=16448",
      "title": "Introduction to AWS Identity and Access Management (IAM)",
      "registration-date": "16 May, 2020",
      "description": "In this course, you will be introduced to AWS Identity and Access Management (IAM). The course will highlight how IAM can be used for authentication and authorization to AWS services. Discussions around IAM policies and roles will also be included, as well as potential use cases for the service. The course will wrap up with a demonstration on how to create an IAM group and user, attach a policy and add a user to a group.",
      "level": "FUNDAMENTAL",
      "duration": "10 MINUTES",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/Video?id=16204",
      "title": "AWS Development Tools Services Overview",
      "registration-date": "15 May, 2020",
      "description": "This course introduces AWS development tools that enable a continuous development pipeline and integrate closely with other AWS services. These tools support a variety of use cases and enable customers to reach ideal solutions.",
      "level": "FUNDAMENTAL",
      "duration": "5 MINUTES",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/Video?id=15875",
      "title": "Introduction to AWS Billing and Cost Management",
      "registration-date": "15 May, 2020",
      "description": "A basic overview of the AWS Billing and Cost Management service and dashboard. Different AWS cost tools, such as Cost Explorer and Budgets, are covered in this introduction. A discussion on the AWS Free Tier is also included in this course.",
      "level": "FUNDAMENTAL",
      "duration": "10 MINUTES",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/eLearning?id=27074",
      "title": "Introduction to Serverless Development",
      "registration-date": "15 May, 2020",
      "description": "This course will orient you to key serverless concepts to help you start developing serverless applications. You will learn how development best practices you already use in server-based development apply to serverless development, and how to adjust your development processes for serverless application development.",
      "level": "FUNDAMENTAL",
      "duration": "25 MINUTES",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/Video?id=16382",
      "title": "Introduction to Amazon Elastic Compute Cloud (EC2)",
      "registration-date": "14 May, 2020",
      "description": "This is an introduction to Amazon Elastic Compute Cloud or Amazon EC2, a web service that provides secure, resizable compute capacity in the cloud. In this course, we provide an overview of the service and demonstrate how to build and configure an Amazon EC2 instance.",
      "level": "FUNDAMENTAL",
      "duration": "10 MINUTES",
      "prereqsuisites": []
    },
    {
      "link": "https://www.aws.training/Details/eLearning?id=29699",
      "title": "AWS Cloud Practitioner Essentials (Second Edition): Introduction to the AWS Cloud",
      "registration-date": "14 May, 2020",
      "description": "This module provides an introduction to the AWS Cloud and the methods available to interact with various AWS services.",
      "level": "FUNDAMENTAL",
      "duration": "20 MINUTES",
      "prereqsuisites": []
    }
  ]
}